yunxiangzhong/IOT-AIX/AIX/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_AIX_ENABLE_LOCAL_CAMERA=y
CONFIG_AIX_ENABLE_CAMERA_PREVIEW=n
CONFIG_AIX_ENABLE_VISION_UPLINK=y
CONFIG_AIX_ENABLE_RISK_RECEIVER=y
CONFIG_AIX_ENABLE_VOICE_PROMPT=y
CONFIG_AIX_VOICE_VOLUME=18
CONFIG_AIX_ENABLE_PNEUMATIC_CONTROL=n
CONFIG_AIX_ENABLE_PNEUMATIC_AUTOMATIC=n
CONFIG_AIX_ENABLE_ONBOARD_RGB=y
CONFIG_AIX_DEVICE_ID="aix-helmet-01"
CONFIG_AIX_VISION_SERVICE_URL="http://192.168.137.1:8008/v1/frames"
CONFIG_AIX_VISION_UPLOAD_PERIOD_MS=400
CONFIG_AIX_VISION_HTTP_TIMEOUT_MS=1500
